[
  {
    "theme": "Social Cognition",
    "description": "How people perceive, interpret, and remember information about themselves and others. This includes topics like schemas, attributions, and cognitive biases.",
    "terms": [
      {
        "term": "Schema",
        "definition": "A mental structure that organizes knowledge and guides information processing."
      },
      {
        "term": "Attribution",
        "definition": "The process of explaining the causes of behavior and events."
      },
      {
        "term": "Cognitive Bias",
        "definition": "Systematic patterns of deviation from norm or rationality in judgment."
      },
      {
        "term": "Priming",
        "definition": "The process by which recent experiences increase the accessibility of a schema, trait, or concept."
      },
      {
        "term": "Heuristic",
        "definition": "Mental shortcuts that ease the cognitive load of making decisions."
      },
      {
        "term": "Confirmation Bias",
        "definition": "The tendency to search for, interpret, and remember information in a way that confirms one's preconceptions."
      },
      {
        "term": "Self-Fulfilling Prophecy",
        "definition": "A belief that leads to its own fulfillment."
      },
      {
        "term": "Fundamental Attribution Error",
        "definition": "The tendency to overemphasize personal characteristics and underestimate situational factors when explaining others' behavior."
      },
      {
        "term": "Actor-Observer Effect",
        "definition": "The tendency to attribute one's own actions to situational factors while attributing others' actions to their character."
      },
      {
        "term": "Availability Heuristic",
        "definition": "Estimating the likelihood of events based on their availability in memory."
      },
      {
        "term": "Representativeness Heuristic",
        "definition": "Judging the probability of an event based on how similar it is to a prototype."
      },
      {
        "term": "Anchoring Effect",
        "definition": "The tendency to rely too heavily on the first piece of information encountered when making decisions."
      },
      {
        "term": "Social Comparison",
        "definition": "Evaluating oneself in relation to others to gain self-knowledge."
      },
      {
        "term": "Impression Formation",
        "definition": "The process by which we form an overall impression of someone's personality based on available information."
      },
      {
        "term": "Stereotyping",
        "definition": "Overgeneralizing characteristics, attributes, and behaviors to a group of people."
      },
      {
        "term": "Ingroup Bias",
        "definition": "The tendency to favor one's own group over others."
      },
      {
        "term": "Outgroup Homogeneity Effect",
        "definition": "The perception that members of an outgroup are more similar to each other than they really are."
      },
      {
        "term": "False Consensus Effect",
        "definition": "The tendency to overestimate the extent to which others share our beliefs and behaviors."
      },
      {
        "term": "Self-Serving Bias",
        "definition": "The tendency to attribute positive events to one's own character but negative events to external factors."
      },
      {
        "term": "Social Identity Theory",
        "definition": "A theory that proposes that a person's self-concept is based on their group memberships."
      },
      {
        "term": "Cognitive Dissonance",
        "definition": "The mental discomfort experienced when holding two or more contradictory beliefs, values, or attitudes."
      },
      {
        "term": "Implicit Association Test (IAT)",
        "definition": "A measure of implicit attitudes that assesses the strength of associations between concepts."
      },
      {
        "term": "Availability Cascade",
        "definition": "A self-reinforcing cycle of belief formation where repeated exposure to a belief increases its perceived validity."
      },
      {
        "term": "Hindsight Bias",
        "definition": "The tendency to see events as having been predictable after they have already occurred."
      },
      {
        "term": "Overconfidence Effect",
        "definition": "The tendency to overestimate one's own abilities or knowledge."
      },
      {
        "term": "Illusory Correlation",
        "definition": "The perception of a relationship between two variables when no such relationship exists."
      },
      {
        "term": "Base Rate Fallacy",
        "definition": "Ignoring statistical information in favor of anecdotal evidence."
      },
      {
        "term": "Optimism Bias",
        "definition": "The belief that one is less likely to experience negative events compared to others."
      },
      {
        "term": "Negativity Bias",
        "definition": "The tendency to give more weight to negative experiences than positive ones."
      },
      {
        "term": "Cognitive Load",
        "definition": "The total amount of mental effort being used in the working memory."
      },
      {
        "term": "Social Facilitation",
        "definition": "The tendency for people to perform differently when in the presence of others than when alone."
      },
      {
        "term": "Social Comparison Theory",
        "definition": "The theory that individuals determine their own social and personal worth based on how they stack up against others."
      },
      {
        "term": "Fundamental Attribution Error",
        "definition": "The tendency to attribute others' actions to their character rather than to situational factors."
      },
      {
        "term": "Self-Perception Theory",
        "definition": "The theory that people develop attitudes by observing their own behavior and concluding what attitudes must have caused them."
      },
      {
        "term": "Cognitive Load Theory",
        "definition": "A theory that suggests that learning happens best under conditions that align with the human cognitive architecture."
      },
      {
        "term": "Social Identity Complexity",
        "definition": "The degree to which an individual's social identities are distinct and non-overlapping."
      }
    ]
  },
  {
    "theme": "Social Influence",
    "description": "How people are affected by the real or imagined presence of others. This involves conformity, obedience, persuasion, and group pressure.",
    "terms": [
      {
        "term": "Conformity",
        "definition": "Adjusting one's behavior or thinking to match those of others."
      },
      {
        "term": "Obedience",
        "definition": "Changing behavior in response to a command from an authority figure."
      },
      {
        "term": "Persuasion",
        "definition": "The process of changing attitudes through arguments and discussion."
      },
      {
        "term": "Social Norms",
        "definition": "Accepted behaviors that an individual is expected to conform to in a particular group, community, or culture."
      },
      {
        "term": "Group Pressure",
        "definition": "The influence exerted by a group that encourages conformity to its norms."
      },
      {
        "term": "Minority Influence",
        "definition": "When a smaller faction within a group influences the majority to accept its views."
      },
      {
        "term": "Compliance",
        "definition": "Changing one's behavior in response to a direct request."
      },
      {
        "term": "Reactance",
        "definition": "A motivational reaction to offers, persons, rules, or regulations that threaten or eliminate specific behavioral freedoms."
      },
      {
        "term": "Social Proof",
        "definition": "The tendency to look to others for cues on how to behave in ambiguous situations."
      },
      {
        "term": "Foot-in-the-Door Technique",
        "definition": "A persuasion strategy that involves getting a person to agree to a large request by first setting them up with a smaller request."
      },
      {
        "term": "Door-in-the-Face Technique",
        "definition": "A persuasion strategy that involves making a large request that is expected to be refused, followed by a smaller request."
      },
      {
        "term": "Lowball Technique",
        "definition": "A persuasion strategy where an initial low offer is made to get a commitment, then the offer is changed to a higher price."
      },
      {
        "term": "Bait-and-Switch Technique",
        "definition": "A deceptive marketing tactic where a product is advertised at a low price, but when the customer tries to buy it, they are told it is unavailable and offered a more expensive item."
      },
      {
        "term": "Social Validation",
        "definition": "The process of validating one's beliefs or behaviors by comparing them with those of others."
      },
      {
        "term": "Ingroup Favoritism",
        "definition": "The tendency to favor members of one's own group over those of other groups."
      },
      {
        "term": "Outgroup Discrimination",
        "definition": "Negative behavior directed toward individuals who are not part of one's own group."
      },
      {
        "term": "Pluralistic Ignorance",
        "definition": "A situation in which a majority of group members privately reject a norm, but incorrectly assume that most others accept it."
      },
      {
        "term": "Social Influence Tactics",
        "definition": "Strategies used to influence the attitudes and behaviors of others."
      },
      {
        "term": "Normative Social Influence",
        "definition": "Influence resulting from a person's desire to gain approval or avoid disapproval."
      },
      {
        "term": "Informational Social Influence",
        "definition": "Influence resulting from one's willingness to accept others' opinions about reality."
      },
      {
        "term": "Social Impact Theory",
        "definition": "A theory that suggests that the likelihood of a person conforming to social influence depends on the strength, immediacy, and number of people in the influencing group."
      },
      {
        "term": "Milgram Experiment",
        "definition": "A series of social psychology experiments conducted by Stanley Milgram that measured the willingness of participants to obey an authority figure."
      },
      {
        "term": "Asch Conformity Experiments",
        "definition": "Experiments that demonstrated the extent to which social pressure from a majority group could affect a person to conform."
      },
      {
        "term": "Social Facilitation",
        "definition": "The tendency for people to perform differently when in the presence of others than when alone."
      },
      {
        "term": "Social Loafing",
        "definition": "The phenomenon where individuals exert less effort to achieve a goal when they work in a group than when they work alone."
      },
      {
        "term": "Deindividuation",
        "definition": "A psychological state characterized by reduced self-awareness and decreased concern for social evaluation, often leading to impulsive and deviant behavior."
      },
      {
        "term": "Group Polarization",
        "definition": "The tendency for group discussion to enhance the group's prevailing attitudes toward a topic."
      },
      {
        "term": "Social Identity Theory",
        "definition": "A theory that proposes that a person's self-concept is based on their group memberships and the value and emotional significance attached to those memberships."
      },
      {
        "term": "Collective Behavior",
        "definition": "Behavior that is not guided by established norms and is often spontaneous and unstructured."
      },
      {
        "term": "Crowd Psychology",
        "definition": "The study of how individuals behave in crowds, often leading to a loss of individuality and increased emotionality."
      }
    ]
  },
  {
    "theme": "Social Behavior",
    "description": "The study of how people interact with each other, including topics like aggression, altruism, and interpersonal attraction.",
    "terms": [
      {
        "term": "Aggression",
        "definition": "Behavior intended to harm another individual."
      },
      {
        "term": "Altruism",
        "definition": "Helping behavior that is motivated by a selfless concern for the welfare of others."
      },
      {
        "term": "Interpersonal Attraction",
        "definition": "The force that draws people together and determines the success of relationships."
      },
      {
        "term": "Prosocial Behavior",
        "definition": "Positive, constructive, helpful behavior."
      },
      {
        "term": "Bystander Effect",
        "definition": "The phenomenon where individuals are less likely to offer help to a victim when other people are present."
      },
      {
        "term": "Social Exchange Theory",
        "definition": "A theory that suggests social behavior is the result of an exchange process to maximize benefits and minimize costs."
      },
      {
        "term": "Reciprocity Norm",
        "definition": "The expectation that people will respond favorably to each other by returning benefits for benefits."
      },
      {
        "term": "Empathy-Altruism Hypothesis",
        "definition": "The idea that empathic concern for a person in need produces an altruistic motivation to help."
      },
      {
        "term": "Evolutionary Psychology",
        "definition": "A theoretical approach that explains mental and psychological traits as adaptations evolved through natural selection."
      },
      {
        "term": "Social Learning Theory",
        "definition": "A theory that suggests behavior is learned through observing others and modeling their actions."
      },
      {
        "term": "Kin Selection",
        "definition": "A form of natural selection that favors altruistic behaviors toward close relatives."
      },
      {
        "term": "Reciprocal Altruism",
        "definition": "The practice of trading favors, where one individual helps another with the expectation that the favor will be returned in the future."
      },
      {
        "term": "Social Dilemmas",
        "definition": "Situations in which individuals face a conflict between personal benefit and the common good."
      },
      {
        "term": "Prisoner's Dilemma",
        "definition": "A standard example of a game theory scenario that illustrates why two individuals might not cooperate, even if it appears that it is in their best interest to do so."
      },
      {
        "term": "Social Identity Theory",
        "definition": "A theory that proposes that a person's self-concept is based on their group memberships and the value and emotional significance attached to those memberships."
      },
      {
        "term": "Ingroup Bias",
        "definition": "The tendency to favor one's own group over others."
      },
      {
        "term": "Outgroup Homogeneity Effect",
        "definition": "The perception that members of an outgroup are more similar to each other than they really are."
      },
      {
        "term": "Social Norms",
        "definition": "The rules and expectations by which a society guides the behavior of its members."
      },
      {
        "term": "Social Facilitation",
        "definition": "The tendency for people to perform differently when in the presence of others than when alone."
      },
      {
        "term": "Social Loafing",
        "definition": "The phenomenon where individuals exert less effort to achieve a goal when they work in a group than when they work alone."
      },
      {
        "term": "Deindividuation",
        "definition": "A psychological state characterized by reduced self-awareness and decreased concern for social evaluation, often leading to impulsive and deviant behavior."
      },
      {
        "term": "Social Comparison",
        "definition": "The process of comparing oneself to others to evaluate one's own abilities, opinions, and social standing."
      },
      {
        "term": "Intergroup Conflict",
        "definition": "Conflict that occurs between different groups, often due to competition for resources or differing values."
      },
      {
        "term": "Collective Behavior",
        "definition": "Behavior that is not guided by established norms and is often spontaneous and unstructured."
      },
      {
        "term": "Crowd Psychology",
        "definition": "The study of how individuals behave in crowds, often leading to a loss of individuality and increased emotionality."
      }
    ]
  },
  {
    "theme": "The Self",
    "description": "How individuals perceive and evaluate themselves in social contexts.",
    "terms": [
      {
        "term": "Self-Concept",
        "definition": "A person's knowledge about themselves, including their beliefs about their traits, behaviors, and feelings."
      },
      {
        "term": "Self-Esteem",
        "definition": "The evaluative aspect of the self-concept: how much people value themselves."
      },
      {
        "term": "Self-Awareness",
        "definition": "The ability to recognize oneself as an individual separate from the environment and other individuals."
      },
      {
        "term": "Self-Discrepancy Theory",
        "definition": "A theory that people compare themselves to internalized standards called 'self-guides'."
      }
    ]
  },
  {
    "theme": "Attitudes and Persuasion",
    "description": "How attitudes are formed, maintained, and changed through persuasive communication.",
    "terms": [
      {
        "term": "Attitude",
        "definition": "A psychological tendency expressed by evaluating a particular entity with some degree of favor or disfavor."
      },
      {
        "term": "Cognitive Dissonance",
        "definition": "The psychological discomfort people feel when their beliefs or behaviors are inconsistent with each other."
      },
      {
        "term": "Elaboration Likelihood Model",
        "definition": "A model explaining two routes to persuasion: central and peripheral."
      },
      {
        "term": "Message Framing",
        "definition": "Presenting an idea in a way that emphasizes either gains or losses."
      },
      {
        "term": "Fear Appeals",
        "definition": "Persuasive messages that attempt to arouse fear in order to change attitudes or behaviors."
      },
      {
        "term": "Social Proof",
        "definition": "The tendency to look to others for cues on how to behave in ambiguous situations."
      },
      {
        "term": "Reciprocity Norm",
        "definition": "The expectation that people will respond favorably to each other by returning benefits for benefits."
      },
      {
        "term": "Foot-in-the-Door Technique",
        "definition": "A persuasion strategy that involves getting a person to agree to a large request by first setting them up with a smaller request."
      },
      {
        "term": "Door-in-the-Face Technique",
        "definition": "A persuasion strategy that involves making a large request that is expected to be refused, followed by a smaller request."
      },
      {
        "term": "Lowball Technique",
        "definition": "A persuasion strategy where an initial low offer is made to get a commitment, then the offer is changed to a higher price."
      },
      {
        "term": "Bait-and-Switch Technique",
        "definition": "A deceptive marketing tactic where a product is advertised at a low price, but when the customer tries to buy it, they are told it is unavailable and offered a more expensive item."
      },
      {
        "term": "Inoculation Theory",
        "definition": "A theory that suggests that exposing people to weak arguments can make them more resistant to stronger arguments later on."
      }
    ]
  },
  {
    "theme": "Group Dynamics",
    "description": "The study of how individuals behave in groups, including leadership, decision-making, and intergroup relations.",
    "terms": [
      {
        "term": "Groupthink",
        "definition": "A psychological phenomenon in which people strive for consensus within a group, often at the expense of critical thinking."
      },
      {
        "term": "Social Facilitation",
        "definition": "Improved performance on tasks in the presence of others."
      },
      {
        "term": "Social Loafing",
        "definition": "The tendency for individuals to put in less effort when working in a group than when working alone."
      },
      {
        "term": "Deindividuation",
        "definition": "A loss of self-awareness in groups, which can lead to atypical behavior."
      }
    ]
  },
  {
    "theme": "Interpersonal Relationships",
    "description": "The formation, maintenance, and dissolution of relationships, including attraction, love, and close relationships.",
    "terms": [
      {
        "term": "Attachment Theory",
        "definition": "A theory about how our early attachments with caregivers shape our relationships in adulthood."
      },
      {
        "term": "Reciprocity",
        "definition": "The tendency to return feelings and behaviors that others have shown toward us."
      },
      {
        "term": "Companionate Love",
        "definition": "A deep, affectionate attachment we feel for those with whom our lives are intertwined."
      },
      {
        "term": "Passionate Love",
        "definition": "An intense longing for union with another."
      },
      {
        "term": "Social Exchange Theory",
        "definition": "A theory that suggests that human relationships are formed by the use of a subjective cost-benefit analysis and the comparison of alternatives."
      },
      {
        "term": "Equity Theory",
        "definition": "A theory that states that people are motivated by fairness in their relationships, seeking to maintain equity between their inputs and outcomes compared to others."
      },
      {
        "term": "Interpersonal Attraction",
        "definition": "The force that draws people together, influenced by factors such as proximity, similarity, and physical attractiveness."
      },
      {
        "term": "Loneliness",
        "definition": "A feeling of sadness or distress about being by oneself or lacking companionship."
      },
      {
        "term": "Conflict Resolution",
        "definition": "Methods and processes involved in facilitating the peaceful ending of conflict and retribution."
      },
      {
        "term": "Social Penetration Theory",
        "definition": "A theory that describes the development of interpersonal relationships as a gradual process of self-disclosure."
      },
      {
        "term": "Uncertainty Reduction Theory",
        "definition": "A theory that suggests that people have a need to reduce uncertainty about others by gaining information about them."
      },
      {
        "term": "Relational Dialectics Theory",
        "definition": "A theory that posits that relationships are dynamic and constantly changing due to the interplay of opposing forces."
      },
      {
        "term": "Interdependence Theory",
        "definition": "A theory that focuses on how the outcomes of one person in a relationship depend on the actions of another."
      },
      {
        "term": "Social Support",
        "definition": "The perception or reality that one is cared for and has assistance available from others."
      },
      {
        "term": "Intimacy",
        "definition": "A close, familiar, and usually affectionate or loving personal relationship with another person."
      },
      {
        "term": "Jealousy",
        "definition": "An emotional response to a perceived threat to a valued relationship."
      },
      {
        "term": "Forgiveness",
        "definition": "The process of letting go of resentment or anger toward someone who has wronged you."
      },
      {
        "term": "Breakup",
        "definition": "The end of a romantic relationship, which can involve emotional distress and changes in social dynamics."
      },
      {
        "term": "Attachment Styles",
        "definition": "Patterns of expectations, needs, and emotions one exhibits in interpersonal relationships, often rooted in early childhood experiences."
      },
      {
        "term": "Social Exchange Theory",
        "definition": "A theory that suggests that human relationships are formed by the use of a subjective cost-benefit analysis and the comparison of alternatives."
      },
      {
        "term": "Companionate Love",
        "definition": "A deep, affectionate attachment we feel for those with whom our lives are intertwined."
      },
      {
        "term": "Passionate Love",
        "definition": "An intense longing for union with another, often characterized by emotional and physical attraction."
      },
      {
        "term": "Relational Maintenance",
        "definition": "The actions and behaviors that partners engage in to keep their relationship functioning and satisfying."
      },
      {
        "term": "Conflict Management",
        "definition": "The practice of recognizing and dealing with disputes in a rational, balanced, and effective way."
      },
      {
        "term": "Social Penetration Theory",
        "definition": "A theory that describes the development of interpersonal relationships as a gradual process of self-disclosure."
      },
      {
        "term": "Uncertainty Reduction Theory",
        "definition": "A theory that suggests that people have a need to reduce uncertainty about others by gaining information about them."
      },
      {
        "term": "Relational Dialectics Theory",
        "definition": "A theory that posits that relationships are dynamic and constantly changing due to the interplay of opposing forces."
      },
      {
        "term": "Interdependence Theory",
        "definition": "A theory that focuses on how the outcomes of one person in a relationship depend on the actions of another."
      },
      {
        "term": "Social Support",
        "definition": "The perception or reality that one is cared for and has assistance available from others."
      },
      {
        "term": "Intimacy",
        "definition": "A close, familiar, and usually affectionate or loving personal relationship with another person."
      },
      {
        "term": "Jealousy",
        "definition": "An emotional response to a perceived threat to a valued relationship."
      },
      {
        "term": "Forgiveness",
        "definition": "The process of letting go of resentment or anger toward someone who has wronged you."
      }
    ]
  },
  {
    "theme": "Stereotypes, Prejudice, and Discrimination",
    "description": "How stereotypes are formed, how prejudice develops, and how these impact social interactions.",
    "terms": [
      {
        "term": "Stereotype",
        "definition": "A generalized belief about a group of people."
      },
      {
        "term": "Prejudice",
        "definition": "A negative attitude toward a group and its members."
      },
      {
        "term": "Discrimination",
        "definition": "Unjustifiable negative behavior toward a group or its members."
      },
      {
        "term": "Implicit Bias",
        "definition": "Attitudes or stereotypes that affect our understanding, actions, and decisions in an unconscious manner."
      },
      {
        "term": "Ingroup Bias",
        "definition": "The tendency to favor one's own group over others."
      },
      {
        "term": "Outgroup Homogeneity Effect",
        "definition": "The perception that members of an outgroup are more similar to each other than they really are."
      },
      {
        "term": "Discrimination",
        "definition": "Unjustifiable negative behavior toward a group or its members."
      },
      {
        "term": "Stereotype Threat",
        "definition": "The risk of confirming negative stereotypes about an individual's group."
      },
      {
        "term": "Social Identity Theory",
        "definition": "A theory that proposes that a person's self-concept is based on their group memberships and the value and emotional significance attached to those memberships."
      },
      {
        "term": "Contact Hypothesis",
        "definition": "The idea that under certain conditions, direct contact between members of different social groups can reduce prejudice."
      },
      {
        "term": "Scapegoating",
        "definition": "Blaming an outgroup for problems faced by one's own group."
      },
      {
        "term": "Stereotype Content Model",
        "definition": "A model that posits that stereotypes about groups are based on perceived warmth and competence."
      },
      {
        "term": "Social Dominance Orientation",
        "definition": "A personality trait that predicts an individual's preference for hierarchy in social settings and the dominance of one group over another."
      },
      {
        "term": "System Justification Theory",
        "definition": "A theory that suggests people have a motivation to defend and justify the status quo, even if it disadvantages them."
      },
      {
        "term": "Tokenism",
        "definition": "The practice of making only a symbolic effort to include members of underrepresented groups."
      },
      {
        "term": "Microaggressions",
        "definition": "Subtle, often unintentional, discriminatory comments or behaviors toward marginalized groups."
      }
    ]
  },
  {
    "theme": "Perspectives in Social Psychology",
    "description": "Different theoretical perspectives used to understand social behavior.",
    "terms": [
      {
        "term": "Sociocultural Perspective",
        "definition": "Emphasizes the impact of social and cultural factors on behavior."
      },
      {
        "term": "Evolutionary Perspective",
        "definition": "Explores how evolutionary principles can explain social behavior."
      },
      {
        "term": "Social Learning Perspective",
        "definition": "Focuses on how individuals learn social behaviors through observation and imitation."
      },
      {
        "term": "Social-Cognitive Perspective",
        "definition": "Examines the cognitive processes that underlie social behavior."
      },
      {
        "term": "Behavioral Perspective",
        "definition": "Focuses on observable behaviors and the ways they're learned through interaction with the environment."
      },
      {
        "term": "Humanistic Perspective",
        "definition": "Emphasizes personal growth and the concept of self-actualization."
      },
      {
        "term": "Biological Perspective",
        "definition": "Examines the physiological and genetic influences on behavior."
      },
      {
        "term": "Cognitive Perspective",
        "definition": "Focuses on mental processes such as perception, memory, and problem-solving."
      },
      {
        "term": "Ecological Perspective",
        "definition": "Considers the complex interplay between individuals and their environments."
      },
      {
        "term": "Critical Perspective",
        "definition": "Analyzes social phenomena through the lens of power dynamics and social justice."
      }
    ]
  }
]